#encoding:utf-8
'''
    根据百度地图的api地址，获取公交车线路信息，来回双线
    公交线路分区域
   读取到线路后，如果已经存在该路线名称则跳过，不存在，则向key_1、key_1_1写路线名称，向key_2写uid_puid值
   bus_line {}    第一次从指定的线路开始抓取，将新线路放进bus_line中，并且向key_1写路线名称，key_2写路线uid；
   后续将key_1 pop出，获取新路线，一直循环
   sadd key_1   337路
   sadd key_1_1   337路   从1_1 pop 出，key_1放线路，用来判断是否已经有该线路了
   sadd key_2   uid__par_id
'''
import json
import redis
import urllib2
import sys
import time
reload(sys)
sys.setdefaultencoding('utf8')
r = redis.StrictRedis(host='localhost', port=6379, db=0)
redis_key_1 = 'py_new_bs_key_1'
redis_key_1_1 = 'py_new_bs_key_1_1'
redis_key_2 = 'py_new_bs_key_2'
url = 'http://map.baidu.com/?newmap=1&reqflag=pcmap&from=webmap&da_par=direct&qt=s&da_src=searchBox.button&src=0'

bus_start=[
    #['北京','131','1路'],
    #['天津','332','1路'],
    #['石家庄','150','1路'],
    #['唐山','265','1路'],
    #['秦皇岛','148','1路'],
    #['邯郸','151','1路'],
    #['邢台','266','1路'],
    #['保定','307','1路'],
    #['张家口','264','1路'],
    #['承德','207','1路'],
   # ['沧州','149','1路'],
    #['廊坊','191','1路'],
   # ['衡水','208','1路'],
    #['太原','176','1路'],
    #['大同','355','1路'],
    #['阳泉','357','1路'],
   # ['长治','356','1路'],
    #['晋城','290','1路'],
    #['朔州','237','1路'],
    #['晋中','238','1路'],
    ['运城','328','1路'],
    ['忻州','367','1路'],
    ['临汾','368','1路'],
    ['吕梁','327','1路'],
    ['呼和浩特','321','1路'],
    ['包头','229','1路'],
    ['乌海','123','1路'],
    ['赤峰','297','1路'],
    ['通辽','64','1路'],
    ['鄂尔多斯','283','1路'],
    ['呼伦贝尔','61','1路'],
    ['巴彦淖尔','169','1路'],
    ['乌兰察布','168','1路'],
    ['兴安盟','62','1路'],
    ['锡林郭勒盟','63','1路'],
    ['阿拉善盟','230','1路'],
    ['沈阳','58','1路'],
    ['大连','167','1路'],
    ['鞍山','320','1路'],
    ['抚顺','184','1路'],
    ['本溪','227','1路'],
    ['丹东','282','1路'],
    ['锦州','166','1路'],
    ['营口','281','1路'],
    ['阜新','59','1路'],
    ['辽阳','351','1路'],
    ['盘锦','228','1路'],
    ['铁岭','60','1路'],
    ['朝阳','280','1路'],
    ['葫芦岛','319','1路'],
    ['长春','53','1路'],
    ['吉林市','55','1路'],
    ['四平','56','1路'],
    ['辽源','183','1路'],
    ['通化','165','1路'],
    ['白山','57','1路'],
    ['松原','52','1路'],
    ['白城','51','1路'],
    ['延边朝鲜族自治州','54','1路'],
    ['哈尔滨','48','1路'],
    ['齐齐哈尔','41','1路'],
    ['鸡西','46','1路'],
    ['鹤岗','43','1路'],
    ['双鸭山','45','1路'],
    ['大庆','50','1路'],
    ['伊春','40','1路'],
    ['佳木斯','42','1路'],
    ['七台河','47','1路'],
    ['牡丹江','49','1路'],
    ['黑河','39','1路'],
    ['绥化','44','1路'],
    ['大兴安岭地区','38','1路'],
    ['上海','289','1路'],
    ['南京','315','1路'],
    ['无锡','317','1路'],
    ['徐州','316','1路'],
    ['常州','348','1路'],
    ['苏州','224','1路'],
    ['南通','161','1路'],
    ['连云港','347','1路'],
    ['淮安','162','1路'],
    ['盐城','223','1路'],
    ['扬州','346','1路'],
    ['镇江','160','1路'],
    ['泰州','276','1路'],
    ['宿迁','277','1路'],
    ['杭州','179','1路'],
    ['宁波','180','1路'],
    ['温州','178','1路'],
    ['嘉兴','334','1路'],
    ['湖州','294','1路'],
    ['绍兴','293','1路'],
    ['金华','333','1路'],
    ['衢州','243','1路'],
    ['舟山','245','1路'],
    ['台州','244','1路'],
    ['丽水','292','1路'],
    ['合肥','127','1路'],
    ['芜湖','129','1路'],
    ['蚌埠','126','1路'],
    ['淮南','250','1路'],
    ['马鞍山','358','1路'],
    ['淮北','253','1路'],
    ['铜陵','337','1路'],
    ['安庆','130','1路'],
    ['黄山','252','1路'],
    ['滁州','189','1路'],
    ['阜阳','128','1路'],
    ['宿州','370','1路'],
    ['巢湖','251','1路'],
    ['六安','298','1路'],
    ['亳州','188','1路'],
    ['池州','299','1路'],
    ['宣城','190','1路'],
    ['福州','300','1路'],
    ['厦门','194','1路'],
    ['莆田','195','1路'],
    ['三明','254','1路'],
    ['泉州','134','1路'],
    ['漳州','255','1路'],
    ['南平','133','1路'],
    ['龙岩','193','1路'],
    ['宁德','192','1路'],
    ['南昌','163','1路'],
    ['景德镇','225','1路'],
    ['萍乡','350','1路'],
    ['九江','349','1路'],
    ['新余','164','1路'],
    ['鹰潭','279','1路'],
    ['赣州','365','1路'],
    ['吉安','318','1路'],
    ['宜春','278','1路'],
    ['抚州','226','1路'],
    ['上饶','364','1路'],
    ['济南','288','1路'],
    ['青岛','236','1路'],
    ['淄博','354','1路'],
    ['枣庄','172','1路'],
    ['东营','174','1路'],
    ['烟台','326','1路'],
    ['潍坊','287','1路'],
    ['济宁','286','1路'],
    ['泰安','325','1路'],
    ['威海','175','1路'],
    ['日照','173','1路'],
    ['莱芜','124','1路'],
    ['临沂','234','1路'],
    ['德州','372','1路'],
    ['聊城','366','1路'],
    ['滨州','235','1路'],
    ['菏泽','353','1路'],
    ['郑州','268','1路'],
    ['开封','210','1路'],
    ['洛阳','153','1路'],
    ['平顶山','213','1路'],
    ['安阳','267','1路'],
    ['鹤壁','215','1路'],
    ['新乡','152','1路'],
    ['焦作','211','1路'],
    ['濮阳','209','1路'],
    ['许昌','155','1路'],
    ['漯河','344','1路'],
    ['三门峡','212','1路'],
    ['南阳','309','1路'],
    ['商丘','154','1路'],
    ['信阳','214','1路'],
    ['周口','308','1路'],
    ['驻马店','269','1路'],
    ['武汉','218','1路'],
    ['黄石','311','1路'],
    ['十堰','216','1路'],
    ['宜昌','270','1路'],
    ['襄阳','156','1路'],
    ['鄂州','122','1路'],
    ['荆门','217','1路'],
    ['孝感','310','1路'],
    ['荆州','157','1路'],
    ['黄冈','271','1路'],
    ['咸宁','362','1路'],
    ['随州','371','1路'],
    ['恩施土家族苗族自治州','373','1路'],
    ['仙桃','1713','1路'],
    ['潜江','1293','1路'],
    ['天门','2654','1路'],
    ['神农架林区','2734','1路'],
    ['长沙','158','1路'],
    ['株洲','222','1路'],
    ['湘潭','313','1路'],
    ['衡阳','159','1路'],
    ['邵阳','273','1路'],
    ['岳阳','220','1路'],
    ['常德','219','1路'],
    ['张家界','312','1路'],
    ['益阳','272','1路'],
    ['郴州','275','1路'],
    ['永州','314','1路'],
    ['怀化','363','1路'],
    ['娄底','221','1路'],
    ['湘西土家族苗族自治州','274','1路'],
    ['广州','257','1路'],
    ['韶关','137','1路'],
    ['深圳','340','1路'],
    ['珠海','140','1路'],
    ['汕头','303','1路'],
    ['佛山','138','1路'],
    ['江门','302','1路'],
    ['湛江','198','1路'],
    ['茂名','139','1路'],
    ['肇庆','338','1路'],
    ['惠州','301','1路'],
    ['梅州','141','1路'],
    ['汕尾','339','1路'],
    ['河源','200','1路'],
    ['阳江','199','1路'],
    ['清远','197','1路'],
    ['东莞','119','1路'],
    ['中山','187','1路'],
    ['潮州','201','1路'],
    ['揭阳','259','1路'],
    ['云浮','258','1路'],
    ['南宁','261','1路'],
    ['柳州','305','1路'],
    ['桂林','142','1路'],
    ['梧州','304','1路'],
    ['北海','295','1路'],
    ['防城港','204','1路'],
    ['钦州','145','1路'],
    ['贵港','341','1路'],
    ['玉林','361','1路'],
    ['百色','203','1路'],
    ['贺州','260','1路'],
    ['河池','143','1路'],
    ['来宾','202','1路'],
    ['崇左','144','1路'],
    ['海口','125','1路'],
    ['三亚','121','1路'],
    ['五指山','1644','1路'],
    ['琼海','2358','1路'],
    ['儋州','1215','1路'],
    ['文昌','2758','1路'],
    ['万宁','1216','1路'],
    ['东方','2634','1路'],
    ['定安','1214','1路'],
    ['屯昌','1641','1路'],
    ['澄迈','2757','1路'],
    ['临高','2033','1路'],
    ['白沙黎族自治','2359','1路'],
    ['昌江黎族自治','1642','1路'],
    ['乐东黎族自治','2032','1路'],
    ['陵水黎族自治','1643','1路'],
    ['保亭黎族苗族自治','1217','1路'],
    ['琼中黎族苗族自治','2031','1路'],
    ['重庆','132','1路'],
    ['成都','75','1路'],
    ['自贡','78','1路'],
    ['攀枝花','81','1路'],
    ['泸州','331','1路'],
    ['德阳','74','1路'],
    ['绵阳','240','1路'],
    ['广元','329','1路'],
    ['遂宁','330','1路'],
    ['内江','248','1路'],
    ['乐山','79','1路'],
    ['南充','291','1路'],
    ['眉山','77','1路'],
    ['宜宾','186','1路'],
    ['广安','241','1路'],
    ['达州','369','1路'],
    ['雅安','76','1路'],
    ['巴中','239','1路'],
    ['资阳','242','1路'],
    ['阿坝藏族羌族自治州','185','1路'],
    ['甘孜藏族自治州','73','1路'],
    ['凉山彝族自治州','80','1路'],
    ['贵阳','146','1路'],
    ['六盘水','147','1路'],
    ['遵义','262','1路'],
    ['安顺','263','1路'],
    ['铜仁地区','205','1路'],
    ['黔西南布依族苗族自治州','343','1路'],
    ['毕节地区','206','1路'],
    ['黔东南苗族侗族自治州','342','1路'],
    ['黔南布依族苗族自治州','306','1路'],
    ['昆明','104','1路'],
    ['曲靖','249','1路'],
    ['玉溪','106','1路'],
    ['保山','112','1路'],
    ['昭通','336','1路'],
    ['丽江','114','1路'],
    ['临沧','110','1路'],
    ['楚雄彝族自治州','105','1路'],
    ['红河哈尼族彝族自治州','107','1路'],
    ['文山壮族苗族自治州','177','1路'],
    ['普洱','108','1路'],
    ['西双版纳傣族自治州','109','1路'],
    ['大理白族自治州','111','1路'],
    ['德宏傣族景颇族自治州','116','1路'],
    ['怒江傈僳族自治州','113','1路'],
    ['迪庆藏族自治州','115','1路'],
    ['拉萨','100','1路'],
    ['昌都地区','99','1路'],
    ['山南地区','97','1路'],
    ['日喀则地区','102','1路'],
    ['那曲地区','101','1路'],
    ['阿里地区','103','1路'],
    ['林芝地区','98','1路'],
    ['西安','233','1路'],
    ['铜川','232','1路'],
    ['宝鸡','171','1路'],
    ['咸阳','323','1路'],
    ['渭南','170','1路'],
    ['延安','284','1路'],
    ['汉中','352','1路'],
    ['榆林','231','1路'],
    ['安康','324','1路'],
    ['商洛','285','1路'],
    ['兰州','36','1路'],
    ['嘉峪关','33','1路'],
    ['金昌','34','1路'],
    ['白银','35','1路'],
    ['天水','196','1路'],
    ['武威','118','1路'],
    ['张掖','117','1路'],
    ['平凉','359','1路'],
    ['酒泉','37','1路'],
    ['庆阳','135','1路'],
    ['定西','136','1路'],
    ['陇南','256','1路'],
    ['临夏回族自治州','182','1路'],
    ['甘南藏族自治州','247','1路'],
    ['西宁','66','1路'],
    ['海东地区','69','1路'],
    ['海北藏族自治州','67','1路'],
    ['黄南藏族自治州','70','1路'],
    ['海南藏族自治州','68','1路'],
    ['果洛藏族自治州','72','1路'],
    ['玉树藏族自治州','71','1路'],
    ['海西蒙古族藏族自治州','65','1路'],
    ['银川','360','1路'],
    ['石嘴山','335','1路'],
    ['吴忠','322','1路'],
    ['固原','246','1路'],
    ['中卫','181','1路'],
    ['乌鲁木齐','92','1路'],
    ['克拉玛依','95','1路'],
    ['吐鲁番地区','89','1路'],
    ['哈密地区','91','1路'],
    ['昌吉回族自治州','93','1路'],
    ['博尔塔拉蒙古自治州','88','1路'],
    ['巴音郭楞蒙古自治州','86','1路'],
    ['阿克苏地区','85','1路'],
    ['克孜勒苏柯尔克孜自治州','84','1路'],
    ['喀什地区','83','1路'],
    ['和田地区','82','1路'],
    ['伊犁哈萨克自治州','90','1路'],
    ['塔城地区','94','1路'],
    ['阿勒泰地区','96','1路'],
    ['石河子','770','1路'],
    ['阿拉尔','731','1路'],
    ['图木舒克','792','1路'],
    ['五家渠','789','1路'],
    ['香港特别行政区','2912','1路'],
    ['澳门特别行政区','2911','1路']
]

index_i = 0
flag = False
bus_line = {}#总线路字典

while True:
    for bs_name_item in bus_start:
        #if index_i % 5 == 0 and index_i !=0:
            #print '目前已经抓到%d条线路' % index_i

        if flag is False:
            print '当前新区域%s：' % bs_name_item[0]
            urls = '%s%s' % (url,'&c=%s&wd=%s' % (bs_name_item[1],bs_name_item[2]))
            req = urllib2.Request(url=urls)
            try:
                res = urllib2.urlopen(req,None, 2)
                data = json.loads(res.read())
            except Exception as e:
                print urls
                print "err: %s" % e
        else:
            line_name = r.spop(redis_key_1_1)

            if line_name:
                exp = line_name.split('||')
                urls = '%s%s' % (url,'&c=%s&wd=%s' % (exp[0],exp[1]) )
                req = urllib2.Request(url=urls)
                try:
                    res = urllib2.urlopen(req,None, 2)
                    data = json.loads(res.read())
                except Exception as e:
                    print urls
                    print "err: %s" % e
            else:
                print "done"
                flag = False
                continue
        flag = True

        if 'content' in data and 'result' in data:
            try:
                bus_name = str(data['current_city']['code']) + '||' + data['result']['return_query']
                print bus_name
                if bus_name not in bus_line:
                    if len(data['content']) > 0 and 'acc_flag' in data['content'][0] and data['content'][0]['acc_flag'] == 1:
                        bus_line[bus_name] = str(data['content'][0]['area'])+'||'+data['content'][0]['uid']
                        if len(data['content']) > 1 and 'acc_flag' in data['content'][1] and data['content'][1]['acc_flag'] == 1:
                            bus_line[bus_name] += '__' + str(data['content'][0]['area'])+'||' + data['content'][1]['uid']

                for item in data['content']:
                    if 'acc_flag' in item and item['acc_flag'] ==1:
                        continue
                    if 'blinfo' in item:
                        for sec in item['blinfo']:
                            tmp_line = str(item['area'])+'||'+sec['addr']
                            if sec['addr'] not in bus_line:
                                bus_line[tmp_line] = str(item['area'])+'||'+sec['uid']
                                if 'pair_uid' in sec:
                                    bus_line[tmp_line] += '__' + str(item['area'])+'||' + sec['pair_uid']

                for line in bus_line:
                    if r.sismember(redis_key_1, str(line)):
                        continue
                    else:
                        index_i += 1
                        r.sadd(redis_key_1, str(line))
                        r.sadd(redis_key_1_1, str(line))
                        r.sadd(redis_key_2, str(bus_line[line]))

            except Exception as e:
                print urls
                print "error: %s" % e

        time.sleep(0.8)